Tekla Open API Reference for Tekla Structures 2025
OkCancel Class
 The OkCancel class represents a control including the Ok-Cancel button group.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.UserControl
 Tekla.Structures.Dialog.UIControls.OkCancel
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class OkCancel : UserControl
Public Class OkCancel
	Inherits UserControl
The OkCancel type exposes the following members.
Constructors
Name | Description
OkCancel
 Initializes a new instance of the OkCancel class.
Top
Events
Name | Description
CancelClicked
 The CancelClicked event is raised when the Cancel button is clicked.
OkClicked
 The OkClicked event is raised when the Ok button is clicked.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace